projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЧтениеДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЧтениеДеклараций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыCMR</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Декларация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусТранзита</Name>
							<Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декларант</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаНачалаТранзита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаОбеспечения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОформления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомераCMR</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоCMR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТаможниОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принципал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КППКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортныеСредства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПунктаНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НеНайденныеПункты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ПрочитанныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДекларации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТранзита</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПрочитаноСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JSONДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПоручительству</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/СтатусыТранзита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыТранзита</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТранзитРазрешен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированоСпециалистом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеЗаключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеЗарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваРазрезервированы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНеВыпущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварВыпущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранзитЗавершенСОговорками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗаключенииДополненияОтказано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеОтправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранзитЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноВПриемеДополнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаможенныйДосмотр</Name>
					<Comment>Машина остановлена на досмотр — расчёт срока транзита не применяется, ожидание</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/СтатусыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИдентифицирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетРучнойКорректировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРассчитан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/ЧтениеДеклараций/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ПутьКФайлу;
	Текст = "ru = ""Текст""; en = ""Text""";
	Фильтр = НСтр(Текст)+"(*.xml)|*.xml";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогОткрытияФайла.Каталог;
		ВыбФайл = Новый Файл(Объект.ПутьКФайлу);
		Текст = "ru = ""; Размер = ""; en = ""; Size = """;
	Иначе
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
		Сообщить(НСтр(Текст));
	КонецЕсли;
КонецПроцедуры

#Область Чтение 


&НаКлиенте
Процедура Сформировать(Команда)
	СчитываниеФайлов();
	ЗагрузитьТаможенныеПункты();
КонецПроцедуры

//Собирает путь к файлам в каталоге
&НаСервере
Функция СчитываниеФайлов()
	Если  (Объект.ПутьКФайлу) ="" Тогда
		ИмяКаталога = "";
	Иначе
		ИмяКаталога = Объект.ПутьКФайлу;
	КонецЕсли;
	
	Маска = "*.xml"; // Только файлы с расширением xml
	МассивФайлов = НайтиФайлы(ИмяКаталога, Маска, Истина);
	
	Если МассивФайлов.Количество() > 0 Тогда          
		Для Каждого ЭлементФайл Из МассивФайлов Цикл             
			
			ЗаполнитьИзXML(ЭлементФайл.ПолноеИмя);
		КонецЦикла;               
	Иначе
		Сообщить("Файлы не найдены.");        
	КонецЕсли;
	
КонецФункции         

Функция ЗагрузитьТаможенныеПункты()
	Для Каждого Строка Из Объект.НеНайденныеПункты Цикл
		Если Не Строка.Код = "" Тогда
			Попытка
				СпарситьСтраницу(Строка.Код);
			Исключение	
			КонецПопытки;	
		КонецЕсли;	
	КонецЦикла;	
КонецФункции

Функция СпарситьСтраницу(Код)
	ssl = Новый ЗащищенноеСоединениеOpenSSL();                      
	URL = "registers/customs-apparatus?";
	ПараметрыЗапроса  = "code=" + Код +"&name=&city=";
	URL =URL + ПараметрыЗапроса;
	Сервис = Новый HTTPСоединение("customs.gov.ru",,,, ,, ssl);
	Если Сервис <> Неопределено Тогда
		Запрос = Новый HTTPЗапрос(URL);
		Результат = Сервис.Получить(Запрос);
		Сервис 	  = Неопределено;		
		Если Результат.КодСостояния = 200 Тогда
			Страница = Результат.ПолучитьТелоКакСтроку("UTF-8");
			Див = "<div class="+Символ(34) + "info-card__title" +Символ(34) +">";
			ДивИтем = СтрЗаменить(Див,"info-card__title","info-card__item-info");
			СтруктураТП = Новый Структура("КодПункта, Код, Наименование, Город, Индекс, Адрес");
			СтруктураТП.Наименование = ПоискБлока(Страница, Див);
			СтруктураТП.Город = ПоискБлока(Страница, ДивИтем,"Город");
			СтруктураТП.Код =  ПоискБлока(Страница, ДивИтем,"Код таможенноо органа");
			СтруктураТП.КодПункта = СтруктураТП.Код; 
			СтруктураТП.Адрес = ПоискБлока(Страница, ДивИтем,"Адрес таможенного органа");
			СтруктураТП.Телефон = ПоискБлока(Страница, ДивИтем,"Телефон");
			СтруктураТП.Индекс =  ПоискБлока(Страница, ДивИтем,"Почтовый индекс");
			
			НовыйТП = Справочники.ТаможенныеПункты.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйТП,СтруктураТП);
			Попытка
				НовыйТП.Записать();
				Возврат НовыйТП.Ссылка;
			Исключение
				Сообщить("Не удалось записать новый таможенный пункт: " + СтруктураТП.Наименование);
			КонецПопытки;	
			//НовыйТП.Наименование = Наименование;
			//НовыйТП.Код = Код;
			//НовыйТП.КодПункта = Код;
			//НовыйТП.Адрес = Адрес;
			
		Иначе
			ТекстОтвета = Результат.ПолучитьТелоКакСтроку("UTF-8");
		КонецЕсли;	
	КонецЕсли;	
КонецФункции

Функция ПоискБлока(ДанныеПоиска, Блок, ВоспомогательнаяСтрока = "")
	Если ВоспомогательнаяСтрока = "" Тогда
		ПозицияНачала = СтрНайти(ДанныеПоиска,Блок);
	Иначе
		ПозицияНачала = СтрНайти(ДанныеПоиска,Блок,,СтрНайти(ДанныеПоиска,ВоспомогательнаяСтрока));
	КонецЕсли;	
	ПозицияКонца=  СтрНайти(ДанныеПоиска,"</div>",,ПозицияНачала);
	Наименование = Сред(ДанныеПоиска, ПозицияНачала, ПозицияКонца - ПозицияНачала);
	Наименование = СокрЛП(СтрЗаменить(Наименование,Блок,""));
	Возврат Наименование;
КонецФункции

//Заполняет ТЧ из XML
Функция ЗаполнитьИзXML(ФайлОбработки) Экспорт
	//Если такой файл уже прочитан то он пропускается
	//Если ПроверитьФайл(ФайлОбработки) Тогда
	//	Возврат "";
	//КонецЕсли;
	
	
	НовыйФайл = Новый ЧтениеТекста(ФайлОбработки, КодировкаТекста.UTF8);
	СтрокаXML = НовыйФайл.Прочитать();
	НовыйФайл.Закрыть();
		
	// Удаляем префиксы
	СтрокаXML = СтрЗаменить(СтрокаXML, "cat_ru:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "tci:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "/tci:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "/cat_ru:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "app:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "/app:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "RUScat_ru:", ""); 
	СтрокаXML = СтрЗаменить(СтрокаXML, "catESAD_cu:", "");
	СтрокаXML = СтрЗаменить(СтрокаXML, "RUDECLcat:", "");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Считанное = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	СериализованныйДокумент = ОбъектXDTOВСтруктуру(Считанное);
	
	Если СериализованныйДокумент.Body.Signature.Object.Свойство("TransitInfo") Тогда
		
		
		TransitInfo = СериализованныйДокумент.Body.Signature.Object.TransitInfo;
		Header = TransitInfo.Header;
		Consigment = TransitInfo.Consigment;
		
		// 4. Проверка на дубль по DocumentID
		DocumentID = TransitInfo.DocumentID;
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Декларация.Ссылка
		//               |ИЗ Обработка.Декларация КАК Декларация
		//               |ГДЕ Декларация.DocumentID = &DocumentID";
		//Запрос.УстановитьПараметр("DocumentID", DocumentID);
		//Результат = Запрос.Выполнить().Выгрузить();
		//Если Результат.Количество() > 0 Тогда
		//    // Документ уже существует, пропускаем или обновляем
		//    Возврат Неопределено; // или можно обновить существующую строку
		//КонецЕсли;
		
		// 5. Создание строки в основной ТЧ
		НоваяСтрокаТЧ = Объект.Декларация.Добавить();
		
		// --- Заполнение основных реквизитов ---
		НоваяСтрокаТЧ.DocumentID = DocumentID;
		
		// Номер ГТД
		TDNumber = Header.TDNumber;
		НомерГТД = TDNumber.CustomsCode + "/" + СтрЗаменить(TDNumber.RegistrationDate, "-", "") + "/" + TDNumber.GTDNumber;
		НоваяСтрокаТЧ.НомерГТД = НомерГТД;
		
		// Статус
		Если TransitInfo.StatusName = "TR_ALLOWED" Тогда
			НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.ТранзитРазрешен;
		ИначеЕсли TransitInfo.StatusName = "TR_REVOKED" Тогда
			НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Аннулирован;
		ИначеЕсли TransitInfo.StatusName = "TR_COMPLETED_W_RESERVATION" Тогда
			НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.ВыполненИЗарезервирован;
		ИначеЕсли TransitInfo.StatusName = "TR_COMPLETED" Тогда
			НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Выполнен;
		ИначеЕсли TransitInfo.StatusName = "TD_REVOKED" Тогда
			НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Отменено;
		ИначеЕсли TransitInfo.StatusName = "TR_ISSUE_DENIED" Тогда
			НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.Отказано;
		ИначеЕсли TransitInfo.StatusName = "TR_TERMINATED" Тогда
			НоваяСтрокаТЧ.СтатусТранзита = Перечисления.СтатусыТранзита.ПрекращеноДосрочно;	
			
		Иначе
			Сообщить(TransitInfo.StatusName);
		КонецЕсли;
		
		// Комментарий и Email
		Комментарий = ?(TransitInfo.Свойство("Comment"), TransitInfo.Comment, "");
		НоваяСтрокаТЧ.Комментарий = Комментарий;
		Email = (Комментарий);
		// Здесь можно искать контрагента по email и заполнять реквизит
		
		// Перевозчик
		Перевозчик = ?(Header.Carrier.Свойство("OrganizationName"), (Справочники.Перевозчики.НайтиПонаименованию(Header.Carrier.OrganizationName)), 
		Справочники.Перевозчики.ПустаяСсылка());
		Если Перевозчик = Справочники.Перевозчики.ПустаяСсылка() Тогда
			Перевозчик = Справочники.Перевозчики.СоздатьЭлемент();
			Перевозчик.Наименование = Header.Carrier.OrganizationName;
			Попытка
				Перевозчик.Записать();
			Исключение
				Сообщить(Header.Carrier.OrganizationName);
			КонецПопытки;	
			
		КонецЕсли;	
		
		НоваяСтрокаТЧ.Перевозчик = Перевозчик.Ссылка;
		// Декларант
		Попытка
			Декларант = ?(TransitInfo.DeclarantDetails.Свойство("OrganizationName"), Справочники.Декларанты.НайтиПоНаименованию((TransitInfo.DeclarantDetails.OrganizationName)), "");
			Если Декларант = Справочники.Декларанты.ПустаяСсылка() Тогда
				Декларант = Справочники.Декларанты.СоздатьЭлемент();
				Декларант.Наименование = TransitInfo.DeclarantDetails.OrganizationName;
				Декларант.Записать();
			КонецЕсли;	
			НоваяСтрокаТЧ.Декларант = Декларант.Ссылка;
		Исключение
		КонецПопытки;	
		// Контрагент
		Контрагент = ?(Consigment.Consignee.Свойство("OrganizationName"), Справочники.Контрагенты.НайтиПоНаименованию((Consigment.Consignee.OrganizationName)), "");
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
			Попытка
				Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
				Контрагент.Наименование = Consigment.Consignee.OrganizationName;
				Контрагент.ИНН = НоваяСтрокаТЧ.ИННКонтрагента;
				Контрагент.КПП = НоваяСтрокаТЧ.КППКонтрагента;
				Контрагент.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("ЧтениеДеклараций.СозданиеКонтрагента",
					УровеньЖурналаРегистрации.Ошибка,,,
					ОписаниеОшибки());
				Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			КонецПопытки;
		КонецЕсли;	
		НоваяСтрокаТЧ.Контрагент = Контрагент.Ссылка;
		// Принципал
		Принципал = ?(Consigment.Consignor.Свойство("OrganizationName"), Справочники.Принципалы.НайтиПоНаименованию((Consigment.Consignor.OrganizationName)), "");
		Если Принципал = Справочники.Принципалы.ПустаяСсылка() Тогда
			Принципал = Справочники.Принципалы.СоздатьЭлемент();
			Принципал.Наименование = Consigment.Consignor.OrganizationName;
			Попытка
				Принципал.Записать()
			Исключение
			КонецПопытки;
			НоваяСтрокаТЧ.Принципал = Принципал.Ссылка;
		КонецЕсли;
		
		// Пункты
		// Пункт отправления и страна начала транзита 
		ПунктОтправления = ?(Header.Свойство("DepartureCountryCode"),Справочники.ТаможенныеПункты.НайтиПоКоду(Header.DepartureCountryCode), "");
		
		Если Не Header.DepartureCountryCode = "RU" Тогда 
			СтранаОтправления = Справочники.СтранаОформления.НайтиПоКоду(Header.DepartureCountryCode);
			Если Не СтранаОтправления = Справочники.СтранаОформления.ПустаяСсылка() Тогда
				ПунктОтправления = СтранаОтправления.ТаможенныйПунктПоУмолчанию; 
			КонецЕсли;	
			
		КонецЕсли;	
		
		НоваяСтрокаТЧ.СтранаНачалаТранзита = Header.DepartureCountryCode;
		
		// Пункт назначения
		Попытка
			НоваяСтрокаТЧ.ПунктНазначения = ?(TransitInfo.DestinationPlace.Свойство("Code"),Справочники.ТаможенныеПункты.НайтиПоКоду(TransitInfo.DestinationPlace.Code) , Справочники.ТаможенныеПункты.НайтиПоНаименованию(TransitInfo.DestinationPlace.OfficeName));
		Исключение
			Сообщить(TransitInfo);
		КонецПопытки;	
		// Код таможни отправления
		НоваяСтрокаТЧ.КодТаможниОтправления = ?(TransitInfo.Свойство("CustomsCode"), TransitInfo.CustomsCode, "");
		НоваяСтрокаТЧ.ПунктОтправления = Справочники.ТаможенныеПункты.НайтиПоКоду( НоваяСтрокаТЧ.КодТаможниОтправления);
		Попытка
			Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктНазначения) Тогда
				Код =?(TransitInfo.DestinationPlace.Свойство("Code"),(TransitInfo.DestinationPlace.Code),""); 
				Наименование = TransitInfo.DestinationPlace.OfficeName;
				Если Не Код = "" Тогда
					НоваяСтрокаТЧ.ПунктНазначения =  СпарситьСтраницу(Код);
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктНазначения) Тогда
					НоваяСтрокаПунктов = Объект.НеНайденныеПункты.Добавить();
					НоваяСтрокаПунктов.ПунктНазначения = TransitInfo.DestinationPlace.OfficeName;
					НоваяСтрокаПунктов.Код = ?(TransitInfo.DestinationPlace.Свойство("Code"),(TransitInfo.DestinationPlace.Code),
					"");
				КонецЕсли;
			КонецЕсли;	
			Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктНазначения) Тогда
				
				
				НоваяСтрокаТЧ.ПунктНазначения = ?(TransitInfo.Свойство("CustomsCode"), СпарситьСтраницу(TransitInfo.CustomsCode), 
				"");
				Если Не ЗначениеЗаполнено(НоваяСтрокаТЧ.ПунктНазначения) Тогда
					НоваяСтрокаПунктов = Объект.НеНайденныеПункты.Добавить();
					НоваяСтрокаПунктов.Код = ?(TransitInfo.Свойство("CustomsCode"), TransitInfo.CustomsCode, "");
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		// Транспортные средства
		Если TransitInfo.Header.Transport.Свойство("TransportMeans") Тогда
			
			ТранспортныеСредства = TransitInfo.Header.Transport.TransportMeans;
			
			// Если одно ТС — это не массив
			Если ТипЗнч(ТранспортныеСредства) <> Тип("Массив") Тогда
				ТранспортныеСредства = Новый Массив;
				ТранспортныеСредства.Добавить(TransitInfo.Header.Transport.TransportMeans);
			КонецЕсли;
			
			СтрокаТС = "";
			Для Каждого ТС Из ТранспортныеСредства Цикл
				ТипТС = ?(ТС.Свойство("TransportKindCode"), ТС.TransportKindCode, "");
				Регион = ?(ТС.свойство("TransportMeansNationalityCode"),ТС.TransportMeansNationalityCode,""); 
				НомерТС = ?(ТС.Свойство("TransportIdentifier"), СтрЗаменить(ТС.TransportIdentifier+Регион," ", ""), "");
				Транспорт = Справочники.ТранспортныеСредства.НайтиПоНаименованию(НомерТС);
				Если Транспорт  = Справочники.ТранспортныеСредства.ПустаяСсылка() Тогда 
					Транспорт  = Справочники.ТранспортныеСредства.СоздатьЭлемент();
					Транспорт.Наименование = НомерТС;
					Транспорт.Код = НомерТС; 
					Транспорт.Тип = Справочники.ТипыТранспортныхСредств.НайтиПоКоду(Лев(ТипТС,2));  
					Попытка
						Транспорт.Записать();
					Исключение
						Транспорт  = Справочники.ТранспортныеСредства.ПустаяСсылка(); 
					КонецПопытки;
				КонецЕсли;
				НоваяСтрокаТС = Объект.ТранспортныеСредства.Добавить();
				НоваяСтрокаТС.ТранспортноеСредство = Транспорт;
				НоваяСтрокаТС.DocumentID = TransitInfo.DocumentID;				
				
			КонецЦикла;
			
			
		КонецЕсли;
		
		// Товарные позиции
		Товары = Consigment.GoodsItem;
		Если ТипЗнч(Товары) <> Тип("Массив") Тогда
			Товары = Новый Массив(1);
			Товары[0] = Consigment.GoodsItem;
		КонецЕсли;
		
		//НоваяСтрокаТЧ.КоличествоКодов = Товары.Количество();
		
		СуммаДокумента = 0;
		ВалютаДокумента = "";                                  
		Для Каждого Товар Из Товары Цикл
			НоваяСтрТов = Объект.КодыCMR.Добавить();
			НоваяСтрТов.DocumentID = DocumentID;
			НоваяСтрТов.КодТНВЭД = Товар.TNVEDCode;
			Если ТипЗнч(Товар.GoodsDescription) = Тип("Массив") Тогда
				Для Каждого Позиция Из Товар.GoodsDescription Цикл
					НоваяСтрТов.Наименование = НоваяСтрТов.Наименование +"/"+Позиция;
				КонецЦикла;
			Иначе	
				НоваяСтрТов.Наименование = (Товар.GoodsDescription);
			КонецЕсли;
			НоваяСтрТов.Сумма = Число(Товар.InvoicedCost);
			НоваяСтрТов.Валюта = ?(Товар.Свойство("InvoicedCurrencyCode"),Справочники.Валюты.НайтиПоНаименованию(Товар.InvoicedCurrencyCode), Справочники.Валюты.НайтиПоНаименованию(Товар.CurrencyCode));;
			
			СуммаДокумента = СуммаДокумента +  Число(Товар.InvoicedCost);
			
		КонецЦикла;
		НоваяСтрокаТЧ.СуммаДокумента = СуммаДокумента;
		НоваяСтрокаТЧ.ВалютаДокумента = НоваяСтрТов.Валюта;
		
		// CMR
		Если Consigment.Свойство("ProducedDocument") Тогда
			ДокументыФайла = Consigment.ProducedDocument;
			Если ТипЗнч(ДокументыФайла) <> Тип("Массив") Тогда
				ДокументыФайла = Новый Массив(1);
				ДокументыФайла[0] = Consigment.ProducedDocument;
			КонецЕсли;
			CMR = "";
			Для Каждого Док Из ДокументыФайла Цикл
				Если Док.DocumentKind = "02015" Тогда // CMR
					CMR = Док.PrDocumentNumber;
					Прервать; // Берем первый CMR
				КонецЕсли;
			КонецЦикла;
			НоваяСтрокаТЧ.НомераCMR = CMR;
			//Дата(СтрЗаменить(ДокументыФайла[2].PrDocumentDate,"-",""))
			//НоваяСтрокаТЧ.ПТД = ДокументыФайла[2].PrDocumentNumber;
			НоваяСтрокаТЧ.КоличествоCMR = ?(CMR <> "", 1, 0);
		КонецЕсли;
		
		// Обеспечение
		Если TransitInfo.Свойство("Guarantee") Тогда
			Гарантия = TransitInfo.Guarantee;
			Попытка
				НоваяСтрокаТЧ.СуммаОбеспечения = Число(Гарантия.TransitGuaranteeDocDetails.GuaranteeAmount.RUSAmount);
				НоваяСтрокаТЧ.ВалютаОбеспечения = Справочники.Валюты.НайтиПоНаименованию(Гарантия.TransitGuaranteeDocDetails.GuaranteeAmount.RUSCurrencyCode);
			Исключение
				
			КонецПопытки;
		КонецЕсли;
		
		// Дата оформления
		НоваяСтрокаТЧ.ДатаОформления = ?(TransitInfo.Свойство("TransitStampDateTime"), XMLЗначение(Тип("Дата"), TransitInfo.TransitStampDateTime), ТекущаяДата());
	КонецЕсли;
	
КонецФункции

Функция ПреобразоватьНомерТД(TD)
	Дата = СтрЗаменить(TD.RegistrationDate, "-", "");
	Дата = Прав(Дата,СтрДлина(Дата) - 2);
	Дата = Прав(Дата,СтрДлина(Дата) - 2) + Лев(Дата, 2 );
	НомерГТД = TD.CustomsCode + "/" + Дата + "/" + TD.GTDNumber;
	Возврат НомерГТД
	
КонецФункции

///проверка наличия файла
Функция ПроверитьФайл(Файл)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Первые 1 Файл Из РегистрСведений.ПрочитанныеДекларации Где Файл = &Файл";
	Запрос.УстановитьПараметр("Файл",Файл);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции	

Функция ОбъектXDTOВСтруктуру(ОбъектXDTO, ПараметрыПреобразования = Неопределено) Экспорт
	
	Структура      = Новый Структура;
	ТипОбъектаXDTO = ОбъектXDTO.Тип();
	
	Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
		
		ИмяСвойства      = Свойство.Имя;
		ЗначениеСвойства = ОбъектXDTO[ИмяСвойства];
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
			
			Структура.Вставить(ИмяСвойства, ОбъектXDTOВСтруктуру(ЗначениеСвойства, ПараметрыПреобразования));
			
		ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда
			
			Структура.Вставить(ИмяСвойства, Новый Массив);
			Для Индекс = 0 По ЗначениеСвойства.Количество() - 1 Цикл
				
				ЭлементСписка = ЗначениеСвойства.Получить(Индекс);
				Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
					Структура[ИмяСвойства].Добавить(ОбъектXDTOВСтруктуру(ЭлементСписка, ПараметрыПреобразования));
				Иначе
					Структура[ИмяСвойства].Добавить(ЭлементСписка);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Структура.Вставить(ИмяСвойства, ЗначениеСвойства);
			
			Если ПараметрыПреобразования <> Неопределено
				И ПараметрыПреобразования.НайтиИдентификаторы
				И Свойство.Тип = ПараметрыПреобразования.ТипUUID Тогда
				
				РезультатПоиска = ПараметрыПреобразования.ТипыИдентификаторов[ТипОбъектаXDTO];
				Если РезультатПоиска <> Неопределено
					И РезультатПоиска.ИмяПоля = ИмяСвойства Тогда
					ПараметрыПреобразования.Идентификаторы[РезультатПоиска.ИмяТаблицы].Вставить(ЗначениеСвойства, РезультатПоиска.ПустоеЗначение);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции
#КонецОбласти

#Область СозданиеДокумента

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Для Каждого Строка Из Объект.Декларация ЦИкл
		РезультатЗаполнения = Новый Структура("Ошибка, Статус, СчитанныйФайл, Документ");
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка из Документ.ОперацияПоПоручительству Где ВнешнийИдентификатор = &DocumentID И НомерГТД =&НомерГТД ");
		Запрос.УстановитьПараметр("НомерГТД", Строка.НомерГТД);
		Запрос.УстановитьПараметр("DocumentID", Строка.DocumentID);
		Если Не Запрос.Выполнить().Пустой() Тогда 
			НовыйДокумент = Запрос.Выполнить().Выгрузить()[0].Ссылка.ПолучитьОбъект();
		Иначе
			НовыйДокумент = Документы.ОперацияПоПоручительству.СоздатьДокумент();
		КонецЕсли;	
		
		
		ЗаполнитьЗначенияСвойств(НовыйДокумент,Строка);
		НовыйДокумент.СтатусОперации = Перечисления.СтатусыОпераций.ВРаботе;
		//НовыйДокумент.СтранаПунктаОтправления = Строка.ПунктОтправления.Код;
		//НовыйДокумент.СтранаПунктаНазначения = Строка.ПунктНазначения.Код;
		НовыйДокумент.ВнешнийИдентификатор = Строка.DocumentID;
		НовыйДокумент.Дата = НовыйДокумент.ДатаОформления;
		Запрос.Текст = ("ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Таблица Из &Таблица как Таблица Где Таблица.DocumentID  =  &DocumentID;
		|ВЫБРАТЬ * Из Вт_Таблица
		|");
		Запрос.УстановитьПараметр("Таблица", Объект.КодыCMR.Выгрузить());
		
		результат  = Запрос.Выполнить().Выбрать();
		Пока результат.Следующий() Цикл
			ЦМР = НовыйДокумент.КодыCMR.Добавить();
			
			ЦМР.НомерCMR = Строка.НомераCMR;
			ЦМР.ПТД = Результат.ПТД;
			ЦМР.Валюта = Результат.Валюта;
			ЦМР.Цена = ?(Результат.КоличествоКодов = 0, 0, Результат.Сумма/Результат.КоличествоКодов); 
			ЦМР.КоличествоКодов = Результат.КоличествоКодов;   
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Таблица",Объект.ТранспортныеСредства.Выгрузить());
		результат  = Запрос.Выполнить().Выгрузить();
		Если Не Результат.Количество() = 0 Тогда
			НовыйДокумент.ОсновноеТС = Результат[0].ТранспортноеСредство;
			Если Результат.Количество() > 1 Тогда
				НовыйДокумент.ДополнительноеТС = Результат[1].ТранспортноеСредство;
			КонецЕсли;	 
		КонецЕсли;	 
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);  
			Ошибка = СформироватьТекстОшибок(НовыйДокумент);
			РезультатЗаполнения.Ошибка = Ошибка;
			РезультатЗаполнения.СчитанныйФайл = Строка.Файл;
			РезультатЗаполнения.Документ =НовыйДокумент.Ссылка;
			РезультатЗаполнения.Статус =  РезультатЗаполнения.Документ.Статус;
		Исключение  
			НовыйДокумент.Записать();
			РезультатЗаполнения.Ошибка = Ошибка;
			РезультатЗаполнения.СчитанныйФайл = Строка.Файл;
			РезультатЗаполнения.Документ = НовыйДокумент.Ссылка;
			РезультатЗаполнения.Статус = РезультатЗаполнения.Документ.Статус;
		КонецПопытки;	
		ЗаписатьРезультатЧтения(РезультатЗаполнения);
	КонецЦикла;	
КонецПроцедуры 

//Записывает результат создания документа в регистр "ПрочитанныеДекларации"
Процедура ЗаписатьРезультатЧтения(РезультатЗаполнения)
	НаборЗаписей = РегистрыСведений.ПрочитанныеДекларации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(РезультатЗаполнения.Документ);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(НаборЗаписей[0],РезультатЗаполнения); 
	Иначе
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,РезультатЗаполнения); 
	КонецЕсли;
	НаборЗаписей.Записать();
КонецПроцедуры 

Функция СформироватьТекстОшибок(Док);
	
	ТекстОшибки = "Не удалось записать по причине: ";
	
	Если Док.Перевозчик = справочники.Перевозчики.ПустаяСсылка() тогда
		ТекстОшибки = ТекстОшибки + "не заполнен переврозчик, ";
	КонецЕсли;	
	
	Если Док.Декларант = справочники.пользователи.ПустаяСсылка()
		ИЛИ Док.Декларант = справочники.Декларанты.ПустаяСсылка() тогда
		ТекстОшибки = ТекстОшибки + "не заполнен декларант, ";
	КонецЕсли;
	
	Если Док.Принципал = справочники.Принципалы.ПустаяСсылка() тогда
		ТекстОшибки = ТекстОшибки + "не заполнен принципал, ";
	КонецЕсли;	
	
	Если Док.Контрагент = справочники.Контрагенты.ПустаяСсылка() тогда
		ТекстОшибки = ТекстОшибки + "не заполнен контрагент, ";
	КонецЕсли;
	
	Если Док.ПунктОтправления = справочники.ТаможенныеПункты.ПустаяСсылка() тогда
		ТекстОшибки = ТекстОшибки + "не заполнен пункт отправления, ";
	КонецЕсли; 
	
	Если Док.ПунктНазначения = справочники.ТаможенныеПункты.ПустаяСсылка() тогда
		ТекстОшибки = ТекстОшибки + "не заполнен пункт назначения, ";
	КонецЕсли; 
	
	Если Док.СуммаОбеспечения = 0 тогда
		ТекстОшибки = ТекстОшибки + "не заполнена сумма обеспечения, ";
	КонецЕсли; 
	
	Длина = СтрДлина(ТекстОшибки);
	
	Если СтрДлина(ТекстОшибки) > 32 тогда 
		ТекстОшибок = Лев(ТекстОшибки, Длина-2) + ".";
	Иначе 
		ТекстОшибок = "";  
	КонецЕсли;
	
	Возврат ТекстОшибок;
	
КонецФункции

#КонецОбласти
